Autodesk.Revit.DB.SlabShapeVertexType
An enumerated type listing all Vertex types of Slab Shape Edit.

Autodesk.Revit.DB.SlabShapeVertexType.Interior
The type of Vertex is Interior.

Autodesk.Revit.DB.SlabShapeVertexType.Edge
The type of Vertex is Edge.

Autodesk.Revit.DB.SlabShapeVertexType.Corner
The type of Vertex is Corner.

Autodesk.Revit.DB.SlabShapeVertexType.Invalid
The type of Vertex is Invalid.